11/data/attachments/a2438622c41af566.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_3c5e316d-1a1c-40ba-9390-d47c245c200b</nif:username>
            <nif:friendToBeAdded>Leslie_that_Actions_94389_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>